In [50]:
import pandas as pd 
import numpy as np
from datetime import datetime

In [2]:
email = 'sviatoslav@emal.com'

In [3]:
email.split('@')

['sviatoslav', 'emal.com']

In [4]:
names = pd.Series(['andrew','bobo','claire','david','5'])

In [6]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [30]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [10]:
email.isdigit()

False

In [11]:
'5'.isdigit()

True

In [14]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [21]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [22]:
len(tech_finance)

2

In [23]:
tickers = pd.Series(tech_finance)

In [24]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [34]:
tickers.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [28]:
tech = 'GOOG,APPL,AMZN'

In [29]:
tech.split(',')[0]

'GOOG'

In [36]:
tickers.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [37]:
messy_names = pd.Series(['andrew  ', 'bo;bo','    claire   '])

In [38]:
messy_names

0         andrew
1            bo;bo
2        claire
dtype: object

In [46]:
messy_names.str.replace(';','').str.strip().str.capitalize

0    Andrew
1      Bobo
2    Claire
dtype: object

In [47]:
def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name

In [48]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

DATETIME

In [67]:
myyear = 2015
mymonth = 1 
myday = 1
myhour = 2 
mymin = 30 
mysec = 15

In [63]:
myday = datetime(myyear,mymonth,myday)

In [64]:
myday

datetime.datetime(2015, 1, 1, 0, 0)

In [68]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [70]:
mydatetime.year

2015

In [71]:
myser = pd.Series(['Nov 3, 1990','2000-01-01', None])

In [72]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [73]:
myser[0]

'Nov 3, 1990'

In [74]:
pd.to_datetime(myser)

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [75]:
timeser = pd.to_datetime(myser)

In [77]:
timeser[0].year

1990

In [78]:
obvi_euro_date = '31-12-2000'

In [79]:
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [80]:
euro_date = '10-12-2000'

In [82]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [83]:
style_date = '12--Dec--2000'

In [85]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [89]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [90]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [92]:
sales['DATE']=pd.to_datetime(sales['DATE'])

In [96]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [100]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [99]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [102]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [103]:
sales = sales.set_index("DATE")

In [104]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [107]:
sales.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [108]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [109]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [111]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [112]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [114]:
pwd

'/Users/svyatoslavkalina/Desktop/Projects/Data_Science_ML/Pandass'

In [116]:
import os

In [115]:
ls

1.ipynb                         input_outup.ipynb
2part_Exercise.ipynb            join_concatinat.ipynb
DataFrames.ipynb                movie_scores.csv
Ecommerce Purchases             mpg.csv
Ggroup.ipynb                    multi_index_example
My_output                       operation.ipynb
RetailSales_BeerWineLiquor.csv  part3.ipynb
concut.ipynb                    text.ipynb
dataMissing.ipynb               tips.csv
example                         usefull_functions.ipynb
first.ipynb

In [117]:
os.getcwd()

'/Users/svyatoslavkalina/Desktop/Projects/Data_Science_ML/Pandass'

In [125]:
df = pd.read_csv('example.csv')

In [126]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [127]:
df.to_csv('aloha.csv')